In [3]:
import pandas as pd
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
import pandas as pd
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [6]:
import pandas as pd
data=[[1,2,3],[4,5]]
df=pd.DataFrame(data)
df

   0  1    2
0  1  2  3.0
1  4  5  NaN

In [7]:
import pandas as pd
data=[['Ram',10],['Hari',12],['Madhav',13]]
df=pd.DataFrame(data,columns=['Name','RollNo'])
df

     Name  RollNo
0     Ram      10
1    Hari      12
2  Madhav      13

In [8]:
import pandas as pd
data=[['Alex',10],['Bob',12],['Clarke',13]]
df=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [9]:
import pandas as pd
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data)
df

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [10]:
import pandas as pd
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [11]:
import pandas as pd
data=[{'a':1,'b':2},{'a':5,'b':10,'c': 20},{'a':19,'b':80,'c':78,'d':47}]
df=pd.DataFrame(data)
df

    a   b     c     d
0   1   2   NaN   NaN
1   5  10  20.0   NaN
2  19  80  78.0  47.0

In [12]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data, index=['first', 'second'])
df

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [13]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df1 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b'])
df1
df2 = pd.DataFrame(data, index=['first', 'second'], columns=['a', 'b','c', 'b1'])
df2

        a   b     c  b1
first   1   2   NaN NaN
second  5  10  20.0 NaN

In [14]:
import pandas as pd  
ser=pd.Series() 
print(ser)

Series([], dtype: float64)

<ipython-input-14-c9b942c9501e>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [15]:
import pandas as pd 
import numpy as np 
data = np.array(['g','e','e','k','s'])

In [16]:
type(data)

numpy.ndarray

In [17]:
print(data)

['g' 'e' 'e' 'k' 's']

In [18]:
ser = pd.Series(data) 
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [19]:
import pandas as pd 
import numpy as np 
l=['g','e','e','e','k','s']
myarr=np.array(l)
ser=pd.Series(myarr)
print(ser) 
df=pd.DataFrame(ser)
print("This is dataframe")
print(df)

0    g
1    e
2    e
3    e
4    k
5    s
dtype: object
This is dataframe
   0
0  g
1  e
2  e
3  e
4  k
5  s

In [20]:
import pandas as pd 
import numpy as np 
ser=pd.Series(10, index =[0, 1, 2, 3, 4, 5]) 
print(ser)

0    10
1    10
2    10
3    10
4    10
5    10
dtype: int64

In [21]:
import pandas as pd  
dict={'Geeks' : 10, 
      'for' : 20, 
      'geeks' : 30}  
ser=pd.Series(dict) 
print(ser)

Geeks    10
for      20
geeks    30
dtype: int64

In [22]:
import pandas as pd  
dict={'Geeks' : 10, 
        'for' : 20, 
        'geeks' : 30} 
ser=pd.DataFrame(dict, index=["name"]) 
print(ser)

      Geeks  for  geeks
name     10   20     30

In [23]:
import pandas as pd 
list = ['g','e','e', 'k','s']  
ser = pd.Series(list) 
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

In [24]:
import pandas as pd
d={'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df=pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4